## 🏗️ Terraform Plan

#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.flow_logs[0] will be created
  + resource "aws_cloudwatch_log_group" "flow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vpc/secure-vpc-staging"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "secure-vpc-flow-logs-staging"
        }
      + tags_all          = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-flow-logs-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
    }

  # aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "secure-vpc-nat-eip-1-staging"
        }
      + tags_all             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-nat-eip-1-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "secure-vpc-nat-eip-2-staging"
        }
      + tags_all             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-nat-eip-2-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
      + vpc                  = (known after apply)
    }

  # aws_flow_log.cloudwatch[0] will be created
  + resource "aws_flow_log" "cloudwatch" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = "${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status}"
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "Name" = "secure-vpc-flow-log-cloudwatch-staging"
        }
      + tags_all                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-flow-log-cloudwatch-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # aws_flow_log.s3[0] will be created
  + resource "aws_flow_log" "s3" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "s3"
      + log_format               = "${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status}"
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "Name" = "secure-vpc-flow-log-s3-staging"
        }
      + tags_all                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-flow-log-s3-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)

      + destination_options {
          + file_format                = "parquet"
          + hive_compatible_partitions = false
          + per_hour_partition         = true
        }
    }

  # aws_iam_role.flow_logs[0] will be created
  + resource "aws_iam_role" "flow_logs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "secure-vpc-flow-logs-"
      + path                  = "/"
      + tags                  = {
          + "Name" = "secure-vpc-flow-logs-role-staging"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-flow-logs-role-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.flow_logs[0] will be created
  + resource "aws_iam_role_policy" "flow_logs" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "secure-vpc-flow-logs-"
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "secure-vpc-igw-staging"
        }
      + tags_all = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-igw-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
      + vpc_id   = (known after apply)
    }

  # aws_kms_alias.cloudwatch_logs[0] will be created
  + resource "aws_kms_alias" "cloudwatch_logs" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/secure-vpc-cloudwatch-logs-staging"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.cloudwatch_logs[0] will be created
  + resource "aws_kms_key" "cloudwatch_logs" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for CloudWatch Logs encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::539247484955:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:CreateGrant",
                          + "kms:DescribeKey",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "kms:EncryptionContext:aws:logs:arn" = "arn:aws:logs:us-east-1:539247484955:log-group:/aws/vpc/secure-vpc-staging"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.us-east-1.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow CloudWatch Logs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Name" = "secure-vpc-cloudwatch-kms-staging"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-cloudwatch-kms-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
    }

  # aws_nat_gateway.main[0] will be created
  + resource "aws_nat_gateway" "main" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "AZ"   = "us-east-1a"
          + "Name" = "secure-vpc-nat-us-east-1a-staging"
        }
      + tags_all                           = {
          + "AZ"          = "us-east-1a"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-nat-us-east-1a-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
    }

  # aws_nat_gateway.main[1] will be created
  + resource "aws_nat_gateway" "main" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "AZ"   = "us-east-1b"
          + "Name" = "secure-vpc-nat-us-east-1b-staging"
        }
      + tags_all                           = {
          + "AZ"          = "us-east-1b"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-nat-us-east-1b-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
    }

  # aws_network_acl.data[0] will be created
  + resource "aws_network_acl" "data" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "secure-vpc-data-nacl-staging"
          + "Tier" = "Data"
        }
      + tags_all   = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-data-nacl-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
          + "Tier"        = "Data"
        }
      + vpc_id     = (known after apply)
    }

  # aws_network_acl.private[0] will be created
  + resource "aws_network_acl" "private" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "secure-vpc-private-nacl-staging"
          + "Tier" = "Private"
        }
      + tags_all   = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-private-nacl-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
          + "Tier"        = "Private"
        }
      + vpc_id     = (known after apply)
    }

  # aws_network_acl.public[0] will be created
  + resource "aws_network_acl" "public" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "secure-vpc-public-nacl-staging"
          + "Tier" = "Public"
        }
      + tags_all   = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-public-nacl-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
          + "Tier"        = "Public"
        }
      + vpc_id     = (known after apply)
    }

  # aws_network_acl_rule.data_inbound_vpc[0] will be created
  + resource "aws_network_acl_rule" "data_inbound_vpc" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = false
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
    }

  # aws_network_acl_rule.data_outbound_vpc[0] will be created
  + resource "aws_network_acl_rule" "data_outbound_vpc" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = true
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
    }

  # aws_network_acl_rule.private_inbound_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "private_inbound_ephemeral" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 140
      + to_port        = 65535
    }

  # aws_network_acl_rule.private_inbound_vpc[0] will be created
  + resource "aws_network_acl_rule" "private_inbound_vpc" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = false
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
    }

  # aws_network_acl_rule.private_outbound_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "private_outbound_ephemeral" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 140
      + to_port        = 65535
    }

  # aws_network_acl_rule.private_outbound_http[0] will be created
  + resource "aws_network_acl_rule" "private_outbound_http" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 80
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 80
    }

  # aws_network_acl_rule.private_outbound_https[0] will be created
  + resource "aws_network_acl_rule" "private_outbound_https" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 110
      + to_port        = 443
    }

  # aws_network_acl_rule.private_outbound_vpc[0] will be created
  + resource "aws_network_acl_rule" "private_outbound_vpc" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = true
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 120
    }

  # aws_network_acl_rule.public_inbound_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "public_inbound_ephemeral" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 140
      + to_port        = 65535
    }

  # aws_network_acl_rule.public_inbound_http[0] will be created
  + resource "aws_network_acl_rule" "public_inbound_http" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 80
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 80
    }

  # aws_network_acl_rule.public_inbound_https[0] will be created
  + resource "aws_network_acl_rule" "public_inbound_https" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 110
      + to_port        = 443
    }

  # aws_network_acl_rule.public_outbound_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "public_outbound_ephemeral" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 140
      + to_port        = 65535
    }

  # aws_network_acl_rule.public_outbound_http[0] will be created
  + resource "aws_network_acl_rule" "public_outbound_http" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 80
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 80
    }

  # aws_network_acl_rule.public_outbound_https[0] will be created
  + resource "aws_network_acl_rule" "public_outbound_https" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 110
      + to_port        = 443
    }

  # aws_network_acl_rule.public_outbound_vpc[0] will be created
  + resource "aws_network_acl_rule" "public_outbound_vpc" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = true
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 150
    }

  # aws_route.private_nat[0] will be created
  + resource "aws_route" "private_nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.private_nat[1] will be created
  + resource "aws_route" "private_nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public_internet will be created
  + resource "aws_route" "public_internet" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.data will be created
  + resource "aws_route_table" "data" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "secure-vpc-data-rt-staging"
          + "Tier" = "Data"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-data-rt-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
          + "Tier"        = "Data"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "secure-vpc-private-rt-us-east-1a-staging"
          + "Tier" = "Private"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-private-rt-us-east-1a-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
          + "Tier"        = "Private"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "secure-vpc-private-rt-us-east-1b-staging"
          + "Tier" = "Private"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-private-rt-us-east-1b-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
          + "Tier"        = "Private"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "secure-vpc-public-rt-staging"
          + "Tier" = "Public"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-public-rt-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
          + "Tier"        = "Public"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.data[0] will be created
  + resource "aws_route_table_association" "data" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.data[1] will be created
  + resource "aws_route_table_association" "data" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.access_logs[0] will be created
  + resource "aws_s3_bucket" "access_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "secure-vpc-access-logs-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "secure-vpc-access-logs-staging"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-access-logs-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket.flow_logs[0] will be created
  + resource "aws_s3_bucket" "flow_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "secure-vpc-flow-logs-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "secure-vpc-flow-logs-staging"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-flow-logs-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_acl.access_logs[0] will be created
  + resource "aws_s3_bucket_acl" "access_logs" {
      + acl    = "log-delivery-write"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.flow_logs[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "flow_logs" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "transition-to-ia"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 365
              + expired_object_delete_marker = false
            }

          + filter {
                # (1 unchanged attribute hidden)
            }

          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + transition {
              + days          = 90
              + storage_class = "GLACIER"
            }
        }
    }

  # aws_s3_bucket_logging.flow_logs[0] will be created
  + resource "aws_s3_bucket_logging" "flow_logs" {
      + bucket        = (known after apply)
      + id            = (known after apply)
      + target_bucket = (known after apply)
      + target_prefix = "flow-logs-bucket-access/"
    }

  # aws_s3_bucket_ownership_controls.access_logs[0] will be created
  + resource "aws_s3_bucket_ownership_controls" "access_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_public_access_block.access_logs[0] will be created
  + resource "aws_s3_bucket_public_access_block" "access_logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.flow_logs[0] will be created
  + resource "aws_s3_bucket_public_access_block" "flow_logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.access_logs[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "access_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.flow_logs[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "flow_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_versioning.flow_logs[0] will be created
  + resource "aws_s3_bucket_versioning" "flow_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group for Application Load Balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "secure-vpc-alb-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "secure-vpc-alb-sg-staging"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-alb-sg-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.app will be created
  + resource "aws_security_group" "app" {
      + arn                    = (known after apply)
      + description            = "Security group for application servers"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "secure-vpc-app-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "secure-vpc-app-sg-staging"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-app-sg-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.bastion will be created
  + resource "aws_security_group" "bastion" {
      + arn                    = (known after apply)
      + description            = "Security group for bastion host"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "secure-vpc-bastion-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "secure-vpc-bastion-sg-staging"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-bastion-sg-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.database will be created
  + resource "aws_security_group" "database" {
      + arn                    = (known after apply)
      + description            = "Security group for database servers"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "secure-vpc-db-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "secure-vpc-db-sg-staging"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-db-sg-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.vpc_endpoints will be created
  + resource "aws_security_group" "vpc_endpoints" {
      + arn                    = (known after apply)
      + description            = "Security group for VPC endpoints"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "secure-vpc-vpce-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "secure-vpc-vpce-sg-staging"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-vpce-sg-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.data[0] will be created
  + resource "aws_subnet" "data" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.100.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "AZ"   = "us-east-1a"
          + "Name" = "secure-vpc-data-us-east-1a-staging"
          + "Tier" = "Data"
        }
      + tags_all                                       = {
          + "AZ"          = "us-east-1a"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-data-us-east-1a-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
          + "Tier"        = "Data"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.data[1] will be created
  + resource "aws_subnet" "data" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.200.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "AZ"   = "us-east-1b"
          + "Name" = "secure-vpc-data-us-east-1b-staging"
          + "Tier" = "Data"
        }
      + tags_all                                       = {
          + "AZ"          = "us-east-1b"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-data-us-east-1b-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
          + "Tier"        = "Data"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "AZ"   = "us-east-1a"
          + "Name" = "secure-vpc-private-us-east-1a-staging"
          + "Tier" = "Private"
        }
      + tags_all                                       = {
          + "AZ"          = "us-east-1a"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-private-us-east-1a-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
          + "Tier"        = "Private"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "AZ"   = "us-east-1b"
          + "Name" = "secure-vpc-private-us-east-1b-staging"
          + "Tier" = "Private"
        }
      + tags_all                                       = {
          + "AZ"          = "us-east-1b"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-private-us-east-1b-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
          + "Tier"        = "Private"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "AZ"   = "us-east-1a"
          + "Name" = "secure-vpc-public-us-east-1a-staging"
          + "Tier" = "Public"
        }
      + tags_all                                       = {
          + "AZ"          = "us-east-1a"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-public-us-east-1a-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
          + "Tier"        = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "AZ"   = "us-east-1b"
          + "Name" = "secure-vpc-public-us-east-1b-staging"
          + "Tier" = "Public"
        }
      + tags_all                                       = {
          + "AZ"          = "us-east-1b"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-public-us-east-1b-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
          + "Tier"        = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "secure-vpc-vpc-staging"
        }
      + tags_all                             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-vpc-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
    }

  # aws_vpc_endpoint.ec2[0] will be created
  + resource "aws_vpc_endpoint" "ec2" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.ec2"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "secure-vpc-ec2-endpoint-staging"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-ec2-endpoint-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.ec2messages[0] will be created
  + resource "aws_vpc_endpoint" "ec2messages" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.ec2messages"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "secure-vpc-ec2messages-endpoint-staging"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-ec2messages-endpoint-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.ecr_api[0] will be created
  + resource "aws_vpc_endpoint" "ecr_api" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.ecr.api"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "secure-vpc-ecr-api-endpoint-staging"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-ecr-api-endpoint-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.ecr_dkr[0] will be created
  + resource "aws_vpc_endpoint" "ecr_dkr" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.ecr.dkr"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "secure-vpc-ecr-dkr-endpoint-staging"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-ecr-dkr-endpoint-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.logs[0] will be created
  + resource "aws_vpc_endpoint" "logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.logs"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "secure-vpc-logs-endpoint-staging"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-logs-endpoint-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.s3[0] will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = (known after apply)
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.s3"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "secure-vpc-s3-endpoint-staging"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-s3-endpoint-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.secretsmanager[0] will be created
  + resource "aws_vpc_endpoint" "secretsmanager" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.secretsmanager"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "secure-vpc-secretsmanager-endpoint-staging"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "secure-vpc-secretsmanager-endpoint-staging"
          + "Owner"       = "infrastructure-team"
          + "Project"     = "secure-vpc"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.ssm[0] will be created
  + resource "aws_vpc_endpoint" "ssm" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
  
...
**Plan output truncated**
```

</details>

**Pusher:** @engrbayo
**Action:** pull_request
**Workflow:** Terraform Deploy
